openenergymonitor/STM32/Software/Sombrero_VE_Working4b/Src/main.c
  double Vmean = (float)chn->sum_V / (float)chn->count;
  double Imean = (float)chn->sum_I / (float)chn->count;

  double f32sum_V_sq_avg = (float)chn->sum_V_sq / (float)chn->count;
  f32sum_V_sq_avg -= (Vmean * Vmean); // offset removal

  double f32sum_I_sq_avg = (float)chn->sum_I_sq / (float)chn->count;
  f32sum_I_sq_avg -= (Imean * Imean); // offset removal

  if (f32sum_V_sq_avg < 0) f32sum_V_sq_avg = 0; // if offset removal cause a negative number
  if (f32sum_I_sq_avg < 0) f32sum_I_sq_avg = 0; // make it 0 to avoid a nan at sqrt.

  Vrms = V_RATIO * sqrt(f32sum_V_sq_avg);
  Irms = I_RATIO * sqrt(f32sum_I_sq_avg);

  double f32_sum_P_avg = (float)chn->sum_P / (float)chn->count;
  double mean_P = f32_sum_P_avg - (Vmean * Imean); // offset removal
  
  realPower = V_RATIO * I_RATIO * mean_P;
  apparentPower = Vrms * Irms;

  // calculate PF, is it necessary to prevent dividing by zero error?
  if (apparentPower != 0) { powerFactor = realPower / apparentPower; }
  else powerFactor = 0;

  Ws_accumulator[ch] += (realPower * (posting_interval / 1000.0));
}

// Finite Impulse Response (FIR) filter-like Power Factor correction.
// based on setting the voltage phase per individual CT channel.
int hunt_PF[CTn];            // which channel are we hunting max power factor on?
// 0 = no power factor hunting.
// 1 = power factor hunt start.
// 2 = power factor hunt to the right. (increase VT lead).
// 3 = power factor hunt to the left. (increase VT lag).
// ?? 4 = hunt complete.
int phase_corrections[CTn];   // store of phase corrections per channel.
double last_powerFactor[CTn]; // PF from previous readings.
double powerFactor_now[CTn];  // PF from most recent readings.

//------------------------------------------
// Process Buffer into Accumulators.
//------------------------------------------
void process_frame (uint16_t offset)
{
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_SET); // blink the led

  uint16_t sample_V, sample_I;
  int16_t signed_V, signed_I;
  bool pfhuntDone[CTn] = {false}; // to hunt one adc_buffer_index per readings_ready, because it's only in readings_ready where PF is calc'd.
  /*
  sprintf(log_buffer, "adc_buff_half_size:%d\r\n", adc_buff_half_size);
  debug_printf(log_buffer);
  log_buffer[0] = '\0';
  */

  for (uint16_t i = 0; i < adc_buff_half_size; i += CTn) // CTn = CT channel quanity.
  {
    
    /* // debug buffer
    sprintf(log_buffer, "signed_v:%d\r\n", signed_V);
    debug_printf(log_buffer);
    log_buffer[0] = '\0';
    */

    //----------------------------------------
    // Power
    //----------------------------------------
    // Cycle through channels, accumulating
    for (int ch = 0; ch < CTn; ch++)
    {
      channel_t *channel = &channels[ch];
      //----------------------------------------
      // Voltage
      //sample_V = adc1_dma_buff[offset + i + ch];
      sample_V = adc1_dma_buff[offset + i + ch + phase_corrections[ch]];  // phase correction could happen here to have higher resolution. 
                                                                          // to shift voltage gives finer grained phase resolution in single-phase mode
                                                                          // because the voltage channel is used by all CTs.
      //if (sample_V == 4095) Vclipped = true; // unlikely
      signed_V = sample_V - MID_ADC_READING;
      channel->sum_V += signed_V;
      channel->sum_V_sq += signed_V * signed_V;
      //----------------------------------------
      // Current
      sample_I = adc3_dma_buff[offset + i + ch];
      if (sample_I == 4095) channel->Iclipped = true; // much more likely, useful safety information.
      signed_I = sample_I - MID_ADC_READING; // mid-rail removal possible through ADC4, option for future perhaps.
      channel->sum_I += signed_I;
      channel->sum_I_sq += signed_I * signed_I;
      //----------------------------------------
      // Power
      channel->sum_P += signed_V * signed_I;
      
      channel->count++;
      
      // upwards-zero-crossing detection, whole waveforms.
      channel->last_positive_V = channel->positive_V; // retrieve the previous value.
      if (signed_V >= 0) { channel->positive_V = true; } // changed > to >= . not important as MID_ADC_READING 2048 not accurate anyway.
      else { channel->positive_V = false; }
      //--------------------------------------------------
      //--------------------------------------------------
      if (!channel->last_positive_V && channel->positive_V) { // looking out for a upwards-zero crossing.
        // if memset later on sets everything to false, doesn't one cycle too many get counted automatically on the next round?
        channel->cycles++; // rather than count cycles for readings_ready, better to have the main loop ask for them.
        // debug cycle count 
        /*
        sprintf(log_buffer, "cycles%d:%ld\r\n", ch, channel->cycles);
        debug_printf(log_buffer);
        log_buffer[0] = '\0';
        */
        //----------------------------------------
        
        if (hunt_PF[ch] == 0 || hunt_PF[ch] == 4 || pfhuntDone[ch]) {
          goto pfSkip;
        }
        else if (hunt_PF[ch] == 1) {
          phase_corrections[ch]++; hunt_PF[ch] = 2; pfhuntDone[ch] = true;
        }
        else if (hunt_PF[ch] == 2) {
          if (last_powerFactor > powerFactor_now) { hunt_PF[ch] = 3; phase_corrections[ch]--; }
          else phase_corrections[ch]++;
          pfhuntDone[ch] = true;
        }
        else if (hunt_PF[ch] == 3) {
          if (last_powerFactor > powerFactor_now) { hunt_PF[ch] = 4; phase_corrections[ch]++; }
          else phase_corrections[ch]--;
          pfhuntDone[ch] = true;
        }
        // test phase corrections.
        sprintf(log_buffer, "pfCorrection%d:%d\r\n", ch, phase_corrections[ch]);
        debug_printf(log_buffer);
        log_buffer[0] = '\0';
        
        pfSkip: // 
        
